"use client";

import { TopBar } from "@/features/common/components/topbar";

const PrivacyPolicyPage = () => {
  return (
    <>
      <TopBar showShare={false} showCart={false} />
      <div className="max-w-4xl mx-auto">
        <h1 className="text-3xl font-bold mb-6 text-center">
          개인정보처리방침
        </h1>
        <div className="text-gray-800 leading-relaxed whitespace-pre-wrap">
          {`개인정보처리방침
㈜멋쟁이사자처럼 (이하 ‘회사’)은 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」(이하 ‘정보통신망법’) 등에 따라 회원의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보처리방침을 수립·공개합니다.

제 1 조 (개인정보 수집 항목 및 방법)
회사는 일반회원 가입 시 아래와 같은 개인정보를 수집하고 있습니다.
(1) 회원가입 시: 성명, 이메일 주소(이상 필수적 수집 정보).
(2) 예약 및 결제 과정: 예약 정보(성명, 이메일 주소, 휴대폰번호)와 결제 정보(신용카드 번호 및 은행 계좌정보 일부 등).
(3) 문의 접수 및 회신 과정: 연락처 및 이메일 주소. 이벤트 진행 시 배송 정보 등을 수집할 수 있습니다.
(4) 서비스 이용 과정: IP주소, 쿠키, 방문 일시, 불량 이용 기록, 기기정보(PC/모바일) 정보가 자동으로 생성되어 수집됩니다.
회사는 스튜디오회원 가입 시 아래와 같은 개인정보를 수집하고 있습니다.
(1) 작가 등록 과정: 필수항목으로 대표자명, 주소 등의 작가 정보와 선택항목으로 유선전화번호, 계좌번호(은행명, 계좌번호, 예금주)를 수집합니다.
(2) 서비스 이용 과정: IP주소, 쿠키, 방문 일시, 불량 이용 기록, 기기정보(PC/모바일) 정보가 자동으로 생성되어 수집됩니다.
(3) 문의 접수 및 회신 과정: 연락처 및 이메일 주소. 이벤트 진행 시 배송 정보 등을 수집할 수 있습니다.
회사는 회원(일반회원, 스튜디오회원)에게 전화를 할 경우, 전화 중개 위탁 서비스에 따라 전화번호를 수집합니다.
개인정보의 수집 방법
(1) 터치즈 PC/모바일 회원가입, 고객센터를 통한 유선 상담, 이메일을 통한 온라인 상담, 카카오톡을 통한 온라인 상담.
(2) 오프라인에서 진행되는 이벤트, 세미나 등.

제 2 조 (개인정보 이용 목적)
회사는 다음의 목적으로 서비스 제공을 위한 최소한의 개인정보만을 수집하며, 수집한 정보를 목적 외로 이용하거나, 회원의 동의 없이 외부에 공개하지 않습니다.
(1) 회원관리: 회원제 서비스 제공에 따른 개인 식별, 가입 의사 확인, 이용약관 위반 회원에 대한 이용 제한 조치, 서비스 부정 이용 제재, 고충 처리 및 분쟁 조정을 위한 기록 보존, 고지사항 전달, 회원탈퇴 의사의 확인.
(2) 서비스 개선 및 맞춤형 서비스 제공: 인구통계학적 분석, 서비스 방문 및 이용 기록의 분석, 개인정보 및 관심에 기반한 맞춤형 서비스 제공 등.
(3) 신규 서비스 개발 및 마케팅 광고 활용: 신규 서비스 개발, 맞춤형 서비스 제공, 인구통계학적 특성에 따른 광고 게재, 서비스의 유효성 확인, 이벤트 및 광고성 정보 제공.
(4) 결제 시스템 제공: 본인 인증, 예약 및 요금 결제, 상품 및 서비스 제공.
(5) 보안 및 안전 환경 구축: 보안, 프라이버시, 안전 측면에서 회원이 안심하고 이용할 수 있는 환경 구축.

제 3 조 (개인정보의 제공)
회사는 회원의 개인정보를 사전 동의 없이 외부에 공개하거나 제공하지 않습니다. 다만, 회원이 사전에 제공에 동의한 경우 또는 법령에 따라 법원 및 수사기관의 요구가 있는 경우 예외로 합니다.
일반회원의 촬영 예약 및 이용, 결제 및 환불 처리 과정에서 개인정보가 제공될 수 있습니다.
(1) 제공받는 자: 터치즈 스튜디오 회원 파트너.
(2) 제공 항목: 이름, 연락처, 결제정보(결제방식 및 결제금액), 이메일.
(3) 제공 목적: 촬영 예약 및 환불 처리.
(4) 제공 기간: 서비스 제공 기간(관련 법령의 규정에 의하여 보존할 필요가 있는 경우 해당 보유기간).

제 4 조 (회원의 권리·의무 및 행사 방법)
회원 및 법정 대리인은 회사의 개인정보 관리책임자에게 언제든지 자신의 개인정보를 조회하거나 수정, 가입 해지를 요청할 수 있습니다.
개인정보 조회, 수정은 서면, 전화, 전자우편 등을 통해 요청 가능하며, 회사는 이를 지체 없이 처리합니다.
회원이 개인정보의 오류에 대해 정정을 요청한 경우, 회사는 정정을 완료하기 전까지 해당 정보를 이용하거나 제공하지 않습니다.

제 5 조 (개인정보의 보유 및 이용 기간)
회사는 개인정보 처리 목적이 달성되면 해당 정보를 지체 없이 파기합니다.
다만, 법령에 따라 일정 기간 보관해야 할 경우 아래와 같은 정보를 보유합니다.
(1) 전자상거래 등에서의 소비자 보호에 관한 법률
- 계약 또는 청약 철회 관련 기록: 5년.
- 대금 결제 및 재화 공급 관련 기록: 5년.
- 소비자 불만 또는 분쟁 처리 기록: 3년.
(2) 통신비밀보호법
- 로그인 기록: 3개월.

제 6 조 (개인정보의 파기)
회사는 회원 탈퇴, 서비스 종료, 회원 동의에 따른 개인정보 보유 기간의 도래 등 개인정보 수집 및 이용 목적이 달성된 경우, 해당 개인정보를 지체 없이 파기합니다.
개인정보 파기 절차는 다음과 같습니다.
(1) 전자적 파일 형태의 정보: 복구 및 재생할 수 없도록 기술적 방법을 이용하여 영구 삭제합니다.
(2) 종이에 출력된 정보: 분쇄기로 분쇄하거나 소각을 통해 파기합니다.

제 7 조 (쿠키의 설치/운영 및 거부에 관한 사항)
쿠키란?
(1) 회사는 개인화되고 맞춤화된 서비스를 제공하기 위해 이용자의 정보를 저장하고 수시로 불러오는 '쿠키(cookie)'를 사용합니다.
(2) 쿠키는 웹사이트가 이용자의 브라우저에 보내는 소량의 텍스트 파일로, 이용자의 기기에 저장됩니다.
(3) 쿠키는 개인정보를 자동적으로 수집하지 않으며, 이용자는 쿠키 저장을 거부하거나 삭제할 수 있습니다.
쿠키 사용 목적
(1) 이용자가 방문한 웹 페이지의 방문 및 이용 기록, 사용 패턴 등을 분석하여 맞춤형 서비스를 제공합니다.
(2) 쿠키는 이용자에게 최적화된 정보와 광고를 제공하는 데 활용됩니다.
쿠키 관리 방법
(1) 이용자는 쿠키 설치에 대한 선택권이 있으며, 웹 브라우저 설정을 통해 쿠키 저장을 거부하거나 삭제할 수 있습니다.
(2) 단, 쿠키 저장을 거부할 경우 로그인 및 맞춤형 서비스 이용이 제한될 수 있습니다.
(3) 쿠키 설정 방법:
- Internet Explorer: 도구 > 인터넷 옵션 > 개인정보 > 고급.
- Chrome: 설정 > 개인정보 및 보안 > 쿠키 및 기타 사이트 데이터.

제 8 조 (개인정보의 기술적/관리적 보호조치)
회사는 회원의 개인정보를 안전하게 보호하기 위해 다음과 같은 기술적, 관리적 조치를 시행하고 있습니다.
기술적 보호조치
(1) 개인정보처리시스템에 대한 접근 권한을 최소화하고, 외부로부터의 무단 접근을 방지하기 위해 방화벽과 침입 탐지 시스템을 설치합니다.
(2) 고유식별정보, 비밀번호, 기타 중요 데이터는 암호화하여 저장 및 관리합니다.
(3) 보안 프로그램을 정기적으로 업데이트하고 점검하여 외부로부터의 침해를 방지합니다.
관리적 보호조치
(1) 내부 관리 계획 수립 및 시행, 개인정보보호 전담조직 운영.
(2) 개인정보 접근 직원에 대한 정기적인 교육 및 보안 점검 실시.
물리적 보호조치
(1) 개인정보를 보관하는 물리적 공간(전산실, 자료보관실 등)에 대해 출입 통제 및 잠금 장치 설치.
(2) 해당 시설에 대한 보안 관리를 철저히 시행.

제 9 조 (개인정보 관리책임자의 연락처)
회원은 개인정보보호와 관련된 모든 민원이나 문의를 개인정보 관리책임자 또는 담당부서로 신고할 수 있습니다.
개인정보 관리책임자: 강소희
부서명: 터치즈팀
연락처: 010-9845-5844
이메일: toucheese.official@gmail.com
기타 개인정보 침해 관련 상담은 아래 기관에 문의할 수 있습니다.
(1) 개인정보침해신고센터: http://privacy.kisa.or.kr / 118.
(2) 대검찰청 사이버수사과: http://www.spo.go.kr / 1301.
(3) 경찰청 사이버안전국: http://www.ctrc.go.kr / 182.

제 10 조 (개인정보처리방침 변경 및 고지의무)
회사는 개인정보처리방침의 내용 추가, 삭제, 수정이 있을 경우 최소 7일 전부터 서비스의 '공지사항'을 통해 고지합니다.
본 개인정보처리방침은 아래 시행일로부터 적용됩니다.
최초 시행일: 2024년 12월 17일.`}
        </div>
      </div>
    </>
  );
};

export default PrivacyPolicyPage;
