"use client";

import { TopBar } from "@/features/common/components/topbar";

const TermsPage = () => {
  return (
    <>
      <TopBar showShare={false} showCart={false} />
      <div className="max-w-4xl mx-auto">
        <h1 className="text-3xl font-bold mb-6 text-center">
          터치즈(TOUCHEESE) 서비스 이용약관
        </h1>
        <div className="text-gray-800 leading-relaxed whitespace-pre-wrap">
          {`
제 1 조 (목적)
이 약관은 ㈜멋쟁이사자처럼 이 제공하는 온라인 서비스 터치즈 (TOUCHEESE) (이하 "서비스"라고 합니다.)의 이용과 관련하여 회사와 회원 간의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.
제 2 조 (정의)
이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
(1) "서비스"라 함은 사진 및 각종 촬영상품(이하 "촬영상품") 정보의 공유 및 예약을 위하여 "회사"가 터치즈를 통해 제공하는 온라인 서비스를 말합니다.
(2) "사이트"라 함은 "회사"가 "서비스"를 운영하는 웹사이트를 의미합니다.
(3) 회사의 "서비스"에 접속하여 이 약관에 따라 "회사"와 이용계약을 체결하고 "회사"가 제공하는 "서비스"를 이용하는 고객은 서비스 이용 목적에 따라 "일반회원"과 "스튜디오회원"으로 구분됩니다.
A. 일반회원: 이 약관에 따라 "회사"와 이용계약을 체결하고 "회사"가 제공하는 "서비스"를 이용할 수 있는 "회원"을 말합니다. 이하 이 약관에서 "회원"이라 함은 "일반회원"을 말합니다.
B. 스튜디오회원: "터치즈 파트너 이용약관"에 따라 "회사"와 이용계약을 체결하고 "회사"가 제공하는 "서비스"를 통해 "촬영 상품" 및 콘텐츠를 등록하거나 제안할 수 있는 회원을 말합니다.
(4) "아이디"라 함은 "회원"의 식별과 "서비스" 이용을 위하여 회원이 정한 온라인 아이디(이메일)를 말합니다.
(5) "비밀번호"라 함은 "회원"이 부여 받은 "아이디"와 일치되는 "회원"임을 확인하고 비밀을 보호하기 위해 "회원" 자신이 정한 온라인 비밀번호를 말합니다.
(6) "게시물"이라 함은 "회원"이 "서비스"를 이용함에 있어 "서비스"에 게시한 부호ㆍ문자ㆍ음성ㆍ음향ㆍ화상ㆍ동영상 등의 정보 형태의 글, 사진, 동영상 및 각종 파일과 링크 등을 말하며, "회원"이 "서비스"를 통해 이용한 "촬영 상품"의 이용후기를 포함합니다.

제 3 조 (약관의 게시와 개정)
"회사"는 이 약관의 내용을 "회원"이 쉽게 알 수 있도록 "서비스" 초기 화면에 게시합니다.
"회사"는 「약관의 규제에 관한 법률」, 「정보통신망 이용촉진 및 정보보호에 관한 법률」(이하 "정보통신망법") 등 관련 법령을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
"회사"가 이 약관을 개정할 경우, 적용일자 및 개정사유를 명시하여 현행 약관과 함께 제1항의 방식에 따라 그 개정약관의 적용일자 7일 전부터 적용일자 전일까지 공지합니다. 다만, "회원"에게 불리한 개정인 경우 30일 전부터 적용일자 전일까지 변경 사항을 공지하며, 공지 외에도 "회원"이 등록한 전자우편, "서비스" 로그인 시 동의창 등의 전자적 수단을 통해 명확히 통지합니다.
"회사"가 전항에 따라 개정약관을 공지 또는 통지하면서 "회원"에게 개정약관의 공지 기간 내에 거부 의사표시를 하지 않으면 동의한 것으로 본다는 뜻을 명확하게 공지 또는 통지하였음에도 "회원"이 명시적으로 거부의 의사표시를 하지 아니한 경우, "회원"이 개정약관에 동의한 것으로 봅니다.
"회원"이 개정약관의 적용에 동의하지 않는 경우, "회사"는 개정약관의 내용을 적용할 수 없으며, 이 경우 "회원"은 이용계약을 해지할 수 있습니다. 다만, 기존약관을 적용할 수 없는 특별한 사정이 있는 경우, "회사"는 이용계약을 해지할 수 있습니다.
제 4 조 (약관의 해석)
"회사"는 "촬영 상품"의 이용 및 예약, 취소, 환불 등에 관한 구체적인 사항을 별도의 이용정책으로 둘 수 있습니다.
이 약관 또는 이용정책에서 정하지 아니한 사항이나 해석에 관하여는 관련 법령 또는 상관례에 따릅니다.

제 5 조 (이용계약 체결)
이용계약은 "회원"이 되고자 하는 자(이하 "회원가입신청자")가 이 약관의 내용에 대하여 동의한 다음 회원가입신청을 하고 "회사"가 이러한 신청에 대하여 승낙함으로써 체결됩니다.
"회사"는 "회원가입신청자"의 신청에 대하여 "서비스" 이용을 승낙할 수 있습니다. 다만, 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다.
(1) "회원가입신청자"가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우(단, "회사"의 재가입 승낙을 얻은 경우는 예외).
(2) 실명이 아니거나 타인의 명의를 이용한 경우.
(3) 허위 정보를 기재하거나, "회사"가 요구하는 내용을 기재하지 않은 경우.
(4) 만 19세 미만의 미성년자가 법정대리인의 동의 없이 신청하는 경우.
(5) "회원가입신청자"의 귀책사유로 승인이 불가능하거나 기타 약관에 위배되는 사항으로 신청하는 경우.
"회사"는 회원가입 신청 시 전문기관을 통해 실명확인 및 본인인증을 요청할 수 있습니다.
"회사"는 "서비스" 관련 설비의 여유가 없거나, 기술적 또는 업무상 문제가 있는 경우 승낙을 유보할 수 있습니다.
제2항과 제4항에 따라 회원가입 신청의 승낙을 하지 않거나 유보한 경우, 원칙적으로 이를 가입 신청자에게 통지합니다.
이용계약의 성립 시기는 "회사"가 가입 완료를 신청 절차 상에서 표시한 시점으로 합니다.
"회사"는 "회원"에 대하여 「영화 및 비디오물의 진흥에 관한 법률」 및 「청소년보호법」 등 관련 법령에 따라 이용제한이나 등급별 제한을 할 수 있습니다.
제 6 조 (회원정보의 변경)
"회원"은 회원가입 신청 시 기재한 사항에 변경이 있는 경우, "서비스" 내 마이페이지 화면을 통하여 이를 수정해야 합니다.
"회원"이 변경사항을 수정하지 않아 발생한 불이익에 대해 "회사"는 책임지지 않습니다.
제 7 조 (개인정보보호 의무)
"회사"는 「정보통신망법」 등 관계 법령이 정하는 바에 따라 "회원"의 개인정보를 보호하기 위해 노력합니다. 개인정보 보호 및 사용에 관해서는 관련 법령 및 "회사"의 개인정보처리방침이 적용됩니다.
"회사"가 개인정보의 보호를 위해 상당한 주의를 기울였음에도 불구하고, "스튜디오회원"이 관련 법령이나 터치즈 파트너 이용약관을 위반하여 "회원"의 개인정보를 유출 또는 유용한 경우, 이에 대해 "회사"는 책임을 지지 않습니다.
제 8 조 ("회원"의 "아이디" 및 "비밀번호" 관리에 대한 의무)
"회원"의 "아이디"와 "비밀번호" 관리 책임은 "회원"에게 있으며, 이를 제3자가 이용하도록 하여서는 안 됩니다.
"회사"는 "회원"의 "아이디"가 개인정보 유출 우려가 있거나, 반사회적 또는 미풍양속에 어긋나거나, "회사"로 오인될 우려가 있는 경우 해당 "아이디"의 이용을 제한할 수 있습니다.
"회원"은 "아이디" 및 "비밀번호"가 도용되거나 제3자가 사용하고 있음을 인지한 경우, 이를 즉시 "회사"에 통지하고 "회사"의 안내를 따라야 합니다.
"회원"이 제3항의 경우에 해당 사실을 "회사"에 통지하지 않거나 "회사"의 안내를 따르지 않아 발생한 불이익에 대해 "회사"는 책임지지 않습니다.
제 9 조 ("회원"에 대한 통지)
"회사"는 "회원"에 대한 통지를 회원가입 신청 시 제공된 전자우편주소 등으로 할 수 있습니다.
"회사"는 "회원" 전체에 대한 통지의 경우, 7일 이상 "회사"의 공지게시판에 게시함으로써 제1항의 통지에 갈음할 수 있습니다.
제 10 조 ("회사"의 의무)
"회사"는 관련 법령과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 안정적인 "서비스" 제공을 위해 최선을 다해 노력합니다.
"회사"는 "회원"이 안전하게 "서비스"를 이용할 수 있도록 개인정보 보호를 위해 보안시스템을 갖추어야 하며, 개인정보처리방침을 공시하고 준수합니다.
"회사"는 "서비스" 이용과 관련하여 발생하는 "회원"의 불만이나 피해구제 요청을 적절히 처리하기 위한 인력 및 시스템을 구비합니다.
"회사"는 "회원"으로부터 제기된 의견이나 불만이 정당하다고 인정될 경우 이를 처리하며, 처리 과정 및 결과를 "회원"에게 전달합니다.
제 11 조 ("회원"의 의무)
"회원"은 다음의 행위를 하여서는 안 됩니다.
(1) 회원가입 신청 또는 회원정보 변경 시 허위 내용을 등록하는 행위.
(2) 타인의 정보를 도용하는 행위.
(3) "회사"가 게시한 정보의 무단 변경.
(4) "회사"가 정한 정보 이외의 정보(컴퓨터 프로그램 등)를 송신 또는 게시하는 행위.
(5) "회사" 및 제3자의 저작권 등 지식재산권을 침해하는 행위.
(6) "회사" 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위.
(7) 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서 양속에 반하는 정보를 "서비스"에 공개 또는 게시하는 행위.
(8) "회사"의 동의 없이 영리를 목적으로 "서비스"를 이용하는 행위.
(9) 기타 불법적이거나 부당한 행위.
"회원"은 관련 법령, 이 약관의 규정, 이용 정책 및 "서비스"와 관련하여 공지한 주의사항, "회사"가 통지하는 사항 등을 준수하여야 하며, 기타 "회사"의 업무에 방해되는 행위를 하여서는 안 됩니다.
제 12 조 ("서비스"의 제공 등)
"회사"는 "회원"에게 다음 각 호와 같은 "서비스"를 제공합니다.
(1) 촬영 상품 검색 서비스.
(2) 촬영 예약 서비스.
(3) 결제 서비스.
(4) 게시판 및 이용후기 등록 서비스.
(5) 기타 "회사"가 추가 개발하거나 다른 회사와의 제휴 계약 등을 통해 제공하는 모든 서비스.
촬영 예약 서비스 및 결제 서비스는 아래 각 호와 같습니다.
(1) 결제 유형: "회원"이 터치즈에게 문의하면 "스튜디오회원"이 주문내역을 확인하고, "회원"이 결제하는 방식.
"회사"는 "서비스"를 일정 범위로 분할하여 각 범위 별로 이용 가능 시간을 지정할 수 있습니다. 이 경우 그 내용을 사전에 공지합니다.
"회사"는 컴퓨터 등 정보통신 설비의 보수점검, 교체 및 고장, 통신 두절 또는 운영상 상당한 이유가 있는 경우 "서비스" 제공을 일시적으로 중단할 수 있습니다. 이 경우 "회사"는 제9조에 따라 "회원"에게 통지합니다. 다만, 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다.
"회사"는 "서비스" 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검 시간은 "서비스" 제공 화면에 공지한 바에 따릅니다.
제 13 조 ("서비스"의 변경)
"회사"는 운영상 또는 기술상 상당한 이유가 있는 경우 제공하고 있는 "서비스"의 전부 또는 일부를 변경할 수 있습니다.
"회사"는 "서비스"의 내용, 이용 방법, 이용 시간에 변경이 있을 경우 그 사유, 변경될 내용 및 제공일자를 변경 전에 "서비스" 초기 화면에 게시합니다.
"회사"는 무료로 제공되는 "서비스"의 일부 또는 전부를 "회사"의 정책 및 운영상 필요에 따라 수정, 중단, 변경할 수 있으며, 이에 대해 관련 법령에 특별한 규정이 없는 한 "회원"에게 별도의 보상을 하지 않습니다.
제 14 조 (정보의 제공 및 광고의 게재)
"회사"는 "회원"이 "서비스" 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 전자우편 등의 방법으로 제공할 수 있습니다. 다만, "회원"은 거래 관련 정보 및 고객 문의 등에 대한 답변을 제외하고는 언제든지 전자우편에 대한 수신을 거절할 수 있습니다.
"회사"는 "서비스" 운영과 관련하여 "서비스" 화면, 홈페이지, 전자우편 등에 광고를 게재할 수 있습니다. "회원"은 광고가 포함된 전자우편의 수신을 거절할 수 있습니다.
제 15 조 ("게시물"의 저작권 및 관리)
"회원"이 "서비스" 내에 게시한 "게시물"의 저작권은 해당 "게시물"의 저작자에게 귀속됩니다.
"회원"이 "서비스"에 게시하는 "게시물"은 검색결과 내지 "서비스" 및 관련 프로모션에 노출될 수 있으며, 필요한 범위 내에서 일부 수정, 복제, 편집되어 게시될 수 있습니다.
"회사"는 "회원"의 동의 없이 제2항 이외의 방식으로 "게시물"을 이용하지 않습니다.
"회사"는 관련 법령에 따라 권리 침해가 인정되거나 "회사"의 정책에 위반되는 "게시물"에 대해 임시 조치, 삭제 등을 취할 수 있습니다.
제 16 조 (권리의 귀속)
"서비스"에 대한 저작권 및 지식재산권은 "회사"에 귀속됩니다.
"회원"은 "회사"가 정한 이용 조건에 따라 "서비스"를 이용할 수 있는 권한만을 부여받으며, 이를 양도, 판매, 담보 제공 등의 처분 행위를 할 수 없습니다.
제 17 조 (계약해제, 해지 등)
"회원"은 언제든지 "서비스" 초기 화면의 고객센터를 통하여 이용계약 해지 신청을 할 수 있으며, "회사"는 관련 법령 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.
"회원"이 이용계약을 해지할 경우, 관련 법령 및 개인정보처리방침에 따라 "회사"가 회원정보를 보유하는 경우를 제외하고는 해지 즉시 "회원"의 모든 데이터는 소멸됩니다. 다만, "회원"이 게시판에 등록한 "게시물"은 삭제되지 않으니, 계약 해지 전 "게시물"을 삭제하시기 바랍니다.
"회원"은 이용계약 해지 신청일로부터 90일 내에 "촬영 상품" 신청이 확정된 경우에는 해지할 수 없으며, 사전에 해당 신청을 취소하여야 합니다. 이 경우 "회사"는 해지 요청을 거절할 수 있습니다.
제 18 조 (촬영상품의 예약 및 취소 등)
"서비스"에 등록된 "촬영 상품"을 예약하고자 하는 "회원"은 "서비스"에서 제공하는 방식에 따라 신청하고, "스튜디오회원"이 이를 승인함으로써 예약이 완료됩니다.
"서비스"에서 제공되는 예약 방식은 "회원"이 터치즈에게 문의 시 "스튜디오회원"이 주문내역을 확인하고, "회원"이 결제하는 방식입니다.
"회사"는 "스튜디오회원"이 등록한 "촬영 상품"의 상세 조건에 대해 보증하지 않으며, "회원"은 예약 전 이를 반드시 확인해야 합니다. 확인하지 않아 발생한 손해는 "회원" 책임입니다.
"회원"은 신용카드 등 "회사"가 지정하는 결제수단으로 사전 결제를 해야 예약이 완료됩니다. 미성년자의 예약은 법정대리인의 동의가 없으면 취소될 수 있습니다.
예약 완료 후 "회사"는 이를 "회원"에게 통지합니다.
예약된 "촬영 상품"의 청약철회 가능 여부는 약관, 이용정책 또는 상세 조건에 명시되며, 청약철회가 가능한 경우 "회원"은 통지일로부터 7일 이내에 철회 요청을 할 수 있습니다.
청약철회 기간이 경과되었거나 청약철회가 제한되는 사유에 해당하는 경우, 철회가 불가능합니다.
"회원"이 철회 가능 기간 이후 예약 취소를 요청하는 경우, 취소 수수료가 부과될 수 있습니다. 이는 상세 조건 또는 이용 정책에 따릅니다.
제 19 조 (이용제한 등)
"회사"는 "회원"이 약관을 위반하거나 "서비스" 운영을 방해한 경우, 경고, 일시정지, 영구 이용정지, 계약해지 등의 조치를 취할 수 있습니다.
"회사"는 관련 법령 위반 사항(명의 도용, 불법 프로그램 제공, 해킹, 악성 프로그램 배포 등)에 대해 즉시 영구 이용 정지를 할 수 있습니다.
6개월 이상 로그인하지 않은 "회원"의 경우, "회사"는 회원정보 보호 및 효율적 운영을 위해 이용을 제한할 수 있습니다.
본 조에 따른 이용제한 시, "회사"는 제9조에 따라 "회원"에게 통지합니다.
"회원"은 이용제한에 대해 이의신청을 할 수 있으며, "회사"는 정당한 사유가 인정될 경우 즉시 이용을 재개합니다.
제 20 조 (책임제한)
"회사"는 천재지변 또는 이에 준하는 불가항력으로 인해 "서비스"를 제공할 수 없는 경우, 책임이 면제됩니다.
"회사"는 "회원"의 귀책사유로 인해 발생한 서비스 이용 장애에 대해 책임지지 않습니다.
"회사"는 "회원" 또는 "스튜디오회원"이 "서비스"에 게시한 정보의 신뢰성, 정확성에 대해 책임을 지지 않습니다.
"회사"는 "회원" 간 또는 "회원"과 제3자 간 거래에 대해 책임지지 않습니다.
무료로 제공되는 "서비스"와 관련하여, 법령에 특별한 규정이 없는 한 "회사"는 책임을 지지 않습니다.
제 21 조 (준거법 및 재판관할)
"회사"와 "회원" 간 제기된 소송은 대한민국 법을 준거법으로 합니다.
"회사"와 "회원" 간 발생한 분쟁에 관한 소송은 "회원"의 주소지를 관할하는 지방법원을 전속관할로 하며, 주소가 없을 경우 거소를 관할하는 지방법원으로 합니다.
해외에 주소나 거소가 있는 "회원"의 경우, 서울중앙지방법원을 관할법원으로 합니다.
제 22 조 (결제 및 환불)
결제 및 환불
결제 및 환불은 네이버 페이 또는 계좌이체를 통해 진행되며 환불 상황은 각 스튜디오의 정책에 따라 환불 된다. 이는 터치즈에서 베타서비스 종료시까지 중개수수료를 면책한다.
제 23 조 (기타사항)
이 약관에 명시되지 않은 사항은 관련 법령 및 상관례에 따릅니다.
"회사"는 원활한 서비스 운영을 위해 필요 시 이용 정책을 별도로 운영하며, 이는 약관과 동일한 효력을 가집니다.
제 24 조 (결제 취소 및 환불)
결제 취소 및 환불 신청
(1) "회원"은 예약된 촬영 상품에 대한 결제를 취소하거나 환불을 요청할 수 있으며, 이는 "서비스"에서 제공하는 방법을 통해 진행합니다.
(2) "회원"은 마이페이지 내 예약 상세 화면에서 취소 및 환불 신청을 할 수 있습니다.
(3) "스튜디오회원"의 경우, [파트너센터] - [견적서 관리] 메뉴를 통해 취소 요청 사항을 확인하고 이를 처리해야 합니다.
환불 처리 기준 및 수수료
(1) 신용카드 결제의 경우, 결제 취소 시점에 따라 취소 금액의 환급이 카드사의 정책에 따라 처리됩니다.
(2) 실시간 계좌이체로 결제한 경우, 환불 요청일로부터 평일 기준 4~5일 이내에 환불이 진행됩니다. 은행별 환불 처리 기준에 따라 다소 차이가 있을 수 있습니다.
(3) 결제 취소 및 부분 취소 시 발생하는 PG수수료는 "스튜디오회원"이 부담합니다.
(4) "회원"이 취소 요청을 진행하기 전 촬영 상품 상세 조건에 명시된 취소 및 환불 정책을 반드시 확인해야 하며, 이에 따릅니다.
예약 변경 및 취소
(1) 예약 변경 기능을 통해 수정된 예약은 기존 예약이 취소되고 변경된 조건을 기준으로 새롭게 정산됩니다.
(2) 변경 확정된 예약을 취소할 경우, 변경된 일정 기준으로 환불 정책이 적용됩니다.
불가항력적 사유에 의한 취소
(1) 천재지변, 전쟁, 전염병, 국가비상사태 등 불가항력적 사유로 인해 촬영이 불가능한 경우, 정부 및 지자체의 지침에 따라 예약이 취소될 수 있습니다.
(2) 이 경우, "회사"는 "회원" 및 "스튜디오회원"의 요청에 따라 환불을 진행할 수 있습니다.
미성년자 예약의 취소 및 환불
(1) 미성년자가 법정대리인의 동의 없이 예약 및 결제를 진행한 경우, 예약은 취소되며 전액 환불됩니다.
(2) 단, 법정대리인 동의를 받은 재산의 범위 내에서 예약된 경우나 미성년자가 사술(속임수)을 사용하여 성년자인 것처럼 행세한 경우에는 환불이 제한될 수 있습니다.

제 25 조 (스튜디오회원 관련 정책)
스튜디오회원의 의무
(1) "스튜디오회원"은 등록된 촬영 상품과 관련하여 "회원"과의 계약 조건을 성실히 이행해야 합니다.
(2) 등록된 촬영 상품 정보는 정확하고 신뢰할 수 있어야 하며, 허위 정보나 과장된 내용을 포함해서는 안 됩니다.
(3) 예약 취소 및 환불 요청 발생 시, "스튜디오회원"은 신속히 "회사"의 환불 절차에 협조해야 합니다.
정산 자료 입력
(1) "스튜디오회원"은 정산을 위해 사업자등록번호, 계좌정보, 관련 증빙서류 등을 제공해야 합니다.
(2) 제공된 정보와 실제 정보가 일치하지 않아 발생하는 문제에 대해 "회사"는 책임지지 않습니다.
결제 수수료 및 세금 신고
(1) "스튜디오회원"은 터치즈 중개수수료 및 결제 수단에 따른 PG수수료를 부담해야하지만 터치즈에서 베타서비스 종료까지 중개수수료를 면책한다.
(2) "회사"는 "스튜디오회원"의 거래 내역을 참고할 수 있도록 예약 내역을 제공하며, 세금 신고 의무는 "스튜디오회원"에게 있습니다.
계약 해지 및 중재
(1) "스튜디오회원"이 약관을 위반하거나 "서비스" 운영을 방해하는 경우, "회사"는 사전 통보 후 계약을 해지할 수 있습니다.
(2) 분쟁 발생 시, "회사"는 중재 역할을 수행하며, 최종 중재 결과를 따르지 않는 경우 "서비스" 이용이 제한될 수 있습니다.

제 26 조 (기타 사항)
약관의 효력
본 약관은 "서비스"를 이용하는 모든 "회원"에게 적용되며, 특별한 규정이 없는 한 약관에 명시된 내용은 법적 효력을 가집니다.
분쟁 해결
(1) "회원" 또는 "스튜디오회원"이 약관과 관련하여 제기하는 모든 민원은 "회사" 고객센터를 통해 접수할 수 있습니다.
(2) "회사"는 접수된 민원을 신속히 처리하기 위해 최선을 다합니다.
약관의 수정 및 개정
본 약관의 내용 중 일부가 무효화되거나 변경될 경우, 나머지 조항은 계속 유효하며, "회사"는 필요에 따라 약관을 개정할 수 있습니다.
제 27 조 (면책 조항)
천재지변 등 면책
"회사"는 천재지변, 전쟁, 전염병, 국가 비상사태, 정전, 화재, 통신망 장애 등 불가항력적인 사유로 인해 "서비스"를 제공할 수 없는 경우, 이에 대한 책임을 지지 않습니다.
회원 귀책 사유
"회원" 또는 "스튜디오회원"의 귀책사유로 인해 발생한 손해에 대해 "회사"는 책임을 지지 않습니다.
예: "회원"의 아이디와 비밀번호 관리 소홀로 발생한 부정 이용, 잘못된 예약 정보 제공 등.
정보 및 거래 책임
(1) "서비스"를 통해 제공되는 정보 및 "회원" 또는 "스튜디오회원"이 게재한 콘텐츠(촬영상품 정보, 후기 등)의 신뢰성, 정확성, 완전성에 대한 책임은 이를 제공한 자에게 있으며, "회사"는 이에 대해 보증하지 않습니다.
(2) "회원" 간 또는 "회원"과 "스튜디오회원" 간 "서비스"를 매개로 이루어진 거래와 관련하여 발생하는 손해에 대해 "회사"는 책임지지 않습니다.
무료 서비스 면책
"회사"는 무료로 제공되는 "서비스"와 관련하여, 관련 법령에 특별한 규정이 없는 한 책임을 지지 않습니다.

제 28 조 (서비스 중단)
"회사"는 다음의 경우 "서비스" 제공을 일시적으로 중단할 수 있습니다.
(1) 긴급한 설비 점검, 교체 및 고장 등의 불가피한 사유가 있는 경우.
(2) 전기통신사업법에 따른 기간통신사업자가 서비스를 중단했을 경우.
(3) 기타 운영상, 기술상 "서비스"를 유지할 수 없는 중대한 사유가 발생한 경우.
"서비스" 중단 시, "회사"는 사전에 공지하며, 부득이한 경우 사후에 공지할 수 있습니다.

제 29 조 (정보통신망 이용 촉진 및 정보 보호)
"회사"는 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」에 따라 "회원"의 개인정보를 보호하기 위해 노력합니다.
"회사"는 개인정보처리방침을 통해 개인정보 수집, 이용, 보관, 파기 등에 관한 세부 내용을 명시합니다.
"회원"의 부주의로 인한 개인정보 유출에 대해서는 "회사"가 책임지지 않습니다.

제 30 조 (광고 및 마케팅)
"회사"는 "회원"에게 유용한 정보를 제공하기 위해 광고를 게재할 수 있습니다.
"회원"은 광고 수신 여부를 선택할 수 있으며, 광고 수신 거부 시 관련 광고는 발송되지 않습니다.
"회원"은 광고를 통해 제3자와 거래를 진행할 경우, 이는 "회원"과 제3자 간의 문제이며, "회사"는 이에 대해 책임지지 않습니다.

제 31 조 (분쟁 해결 및 관할법원)
분쟁 해결 노력
"회사"와 "회원" 간 발생한 분쟁은 상호 간 원만한 해결을 위해 노력합니다.
관할법원
(1) 분쟁이 해결되지 않을 경우, 대한민국 법률에 따라 분쟁을 처리하며, 관할법원은 "회원"의 주소지 관할 지방법원으로 합니다.
(2) 주소지가 없는 경우, 거소를 관할하는 지방법원을 관할법원으로 하며, 해외에 거주하는 경우에는 서울중앙지방법원을 관할법원으로 합니다.

부칙
본 약관은 2024년 12월 17일부터 적용됩니다.
본 약관 시행 이전에 가입한 "회원"은 변경된 약관에 동의한 것으로 간주됩니다.
단, 동의를 원하지 않을 경우 "회원"은 언제든지 이용계약을 해지할 수 있습니다.`}
        </div>
      </div>
    </>
  );
};

export default TermsPage;
